Prácticas/bateriaPruebasP4/servidor_solo/Servidor_Solo_siege_0.txt
** SIEGE 3.0.5
** Preparing 15 concurrent users for battle.
The server is now under siege...

Lifting the server siege...      done.

Transactions:		       14474 hits
Availability:		      100.00 %
Elapsed time:		       59.97 secs
Data transferred:	        0.81 MB
Response time:		        0.06 secs
Transaction rate:	      241.35 trans/sec
Throughput:		        0.01 MB/sec
Concurrency:		       14.93
Successful transactions:       14474
Failed transactions:	           0
Longest transaction:	        3.15
Shortest transaction:	        0.00