Prácticas/bateriaPruebasP4/servidor_solo/Servidor_Solo_siege_3.txt
** SIEGE 3.0.5
** Preparing 15 concurrent users for battle.
The server is now under siege...

Lifting the server siege...      done.

Transactions:		       15980 hits
Availability:		      100.00 %
Elapsed time:		       59.98 secs
Data transferred:	        0.90 MB
Response time:		        0.06 secs
Transaction rate:	      266.42 trans/sec
Throughput:		        0.01 MB/sec
Concurrency:		       14.92
Successful transactions:       15980
Failed transactions:	           0
Longest transaction:	        3.07
Shortest transaction:	        0.00