Prácticas/bateriaPruebasP4/servidor_solo/Servidor_Solo_siege_4.txt
** SIEGE 3.0.5
** Preparing 15 concurrent users for battle.
The server is now under siege...

Lifting the server siege...      done.

Transactions:		       14617 hits
Availability:		      100.00 %
Elapsed time:		       59.98 secs
Data transferred:	        0.82 MB
Response time:		        0.06 secs
Transaction rate:	      243.70 trans/sec
Throughput:		        0.01 MB/sec
Concurrency:		       14.95
Successful transactions:       14617
Failed transactions:	           0
Longest transaction:	        3.39
Shortest transaction:	        0.00