Prácticas/bateriaPruebasP4/servidor_solo/Servidor_Solo_siege_7.txt
** SIEGE 3.0.5
** Preparing 15 concurrent users for battle.
The server is now under siege...

Lifting the server siege...      done.

Transactions:		       14739 hits
Availability:		      100.00 %
Elapsed time:		       59.98 secs
Data transferred:	        0.83 MB
Response time:		        0.06 secs
Transaction rate:	      245.73 trans/sec
Throughput:		        0.01 MB/sec
Concurrency:		       14.94
Successful transactions:       14739
Failed transactions:	           0
Longest transaction:	        2.60
Shortest transaction:	        0.00