Prácticas/bateriaPruebasP4/servidor_solo/Servidor_Solo_siege_8.txt
** SIEGE 3.0.5
** Preparing 15 concurrent users for battle.
The server is now under siege...

Lifting the server siege...      done.

Transactions:		       15860 hits
Availability:		      100.00 %
Elapsed time:		       59.98 secs
Data transferred:	        0.89 MB
Response time:		        0.06 secs
Transaction rate:	      264.42 trans/sec
Throughput:		        0.01 MB/sec
Concurrency:		       14.96
Successful transactions:       15860
Failed transactions:	           0
Longest transaction:	        2.17
Shortest transaction:	        0.00